## Identifying Data Quality Issues

Data cleaning is a core part of data science — often taking 60–80% of project time. Before fixing data, you must first identify what’s wrong using a structured approach.

### Why Data Becomes “Dirty”

Data issues arise from:

    Human error

    System glitches

    Data integration problems

    Real-world inconsistencies

In [659]:
# imports 
import pandas as pd

In [660]:
# load data 
df_titanic = pd.read_csv("titanic.csv")

In [661]:
# show head 
df_titanic.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Unnamed: 4,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [662]:
# check shape
df_titanic.shape

(893, 13)

In [663]:
# check info
df_titanic.info()

<class 'pandas.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   893 non-null    int64
 1   PassengerId  893 non-null    int64
 2   Survived     893 non-null    int64
 3   Pclass       893 non-null    str
 4   Unnamed: 4   893 non-null    str
 5   Sex          893 non-null    str
 6   Age          716 non-null    float64
 7   SibSp        893 non-null    int64
 8   Parch        893 non-null    int64
 9   Ticket       893 non-null    str
 10  Fare         893 non-null    float64
 11  Cabin        204 non-null    str
 12  Embarked     891 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 90.8 KB

In [664]:
df_titanic["Age"]

0      220.0
1       38.0
2       26.0
3       35.0
4       35.0
       ...
888      NaN
889     26.0
890     32.0
891     32.0
892     27.0
Name: Age, Length: 893, dtype: float64

### The Main Categories of Data Quality Issues

#### 1. Missing Values

Empty cells, `NaN`, `NULL`, or placeholder values such as `"N/A"` or `"999"`.

**Problem:**  
Missing values can break calculations, distort averages, and introduce bias into analysis if not handled properly.

In [665]:
# how to check for missing values 
df_titanic.isna().sum()

Unnamed: 0       0
PassengerId      0
Survived         0
Pclass           0
Unnamed: 4       0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          689
Embarked         2
dtype: int64

In [666]:
df_titanic.isnull().sum()

Unnamed: 0       0
PassengerId      0
Survived         0
Pclass           0
Unnamed: 4       0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          689
Embarked         2
dtype: int64

#### 2. Duplicate Records

Exact duplicates or near-duplicate records with slight variations.

**Problem:**  
Duplicates inflate counts, distort summary statistics, and can lead to double-counting in business metrics.

In [667]:
# example check for duplicates 
df_titanic.duplicated().sum()

np.int64(1)

#### 3. Inconsistent Formatting

Different formats used for the same type of data, such as:
- Multiple date formats
- Inconsistent name casing
- Different phone number formats

**Problem:**  
Prevents accurate grouping, sorting, filtering, and matching of records.

In [668]:
# example  check for inconsistent Formats 
df_titanic["Pclass"].value_counts()

Pclass
3    470
1    201
2    173
?     49
Name: count, dtype: int64

In [669]:
df_titanic["Sex"].value_counts()

Sex
male      579
female    314
Name: count, dtype: int64

In [670]:
df_titanic["Cabin"].value_counts()

Cabin
G6             4
C23 C25 C27    4
B96 B98        4
F33            3
E101           3
              ..
E17            1
A24            1
C50            1
B42            1
C148           1
Name: count, Length: 147, dtype: int64

#### 4. Invalid Data Types

- Numbers stored as text  
- Dates stored as strings  
- Mixed units (e.g., `"25 years"`)

**Problem:**  
Prevents mathematical operations, proper sorting, and accurate analysis.

In [671]:
# example 
df_titanic.info()

<class 'pandas.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   893 non-null    int64
 1   PassengerId  893 non-null    int64
 2   Survived     893 non-null    int64
 3   Pclass       893 non-null    str
 4   Unnamed: 4   893 non-null    str
 5   Sex          893 non-null    str
 6   Age          716 non-null    float64
 7   SibSp        893 non-null    int64
 8   Parch        893 non-null    int64
 9   Ticket       893 non-null    str
 10  Fare         893 non-null    float64
 11  Cabin        204 non-null    str
 12  Embarked     891 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 90.8 KB

In [672]:
df_titanic["Pclass"].value_counts()

Pclass
3    470
1    201
2    173
?     49
Name: count, dtype: int64

#### 5. Structural Issues

- Poor column names (e.g., `"Unnamed: 3"`, `"Col_A"`)  
- Spaces or special characters in column names  
- Inconsistent naming conventions  

**Problem:**  
Makes code harder to write, maintain, and debug.

In [673]:
# example
df_titanic.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Unnamed: 4,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [674]:
df_titanic.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Unnamed: 4', 'Sex',
       'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

#### 6. Outliers and Impossible Values

Examples:
- Negative ages  
- Unrealistic salaries  
- Future birth dates  

**Problem:**  
Skews statistical analysis and leads to misleading conclusions.

In [675]:
# example 
df_titanic.describe()

,Unnamed: 0,PassengerId,Survived,Age,SibSp,Parch,Fare
count,893.000000,893.000000,893.000000,716.000000,893.000000,893.000000,893.000000
mean,445.989922,446.992161,0.382979,29.975098,0.521837,0.380739,32.155318
std,257.913891,257.917707,0.486386,16.153539,1.101784,0.805355,49.648580
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000
25%,223.000000,224.000000,0.000000,20.375000,0.000000,0.000000,7.895800
50%,446.000000,447.000000,0.000000,28.000000,0.000000,0.000000,14.454200
75%,669.000000,670.000000,1.000000,38.000000,1.000000,0.000000,31.000000
max,890.000000,891.000000,1.000000,220.000000,8.000000,6.000000,512.329200

In [676]:
df_titanic["Fare"].value_counts()

Fare
8.0500     43
13.0000    43
7.8958     38
7.7500     35
26.0000    31
           ..
13.8583     1
50.4958     1
5.0000      1
9.8458      1
10.5167     1
Name: count, Length: 248, dtype: int64

### The 5-Step Data Quality Assessment Framework

| Step | Check        | Method                           | Red Flag                 |
| ---- | ------------ | -------------------------------- | ------------------------ |
| 1    | Completeness | `df.info()`, `df.isnull().sum()` | >10% missing             |
| 2    | Uniqueness   | `df.duplicated().sum()`          | Duplicates in key fields |
| 3    | Validity     | `df.describe()`                  | Impossible values        |
| 4    | Consistency  | `df[col].value_counts()`         | Multiple formats         |
| 5    | Data Types   | `df.dtypes`                      | Numeric stored as object |

## Handling Missing Values

Missing values are unavoidable in real-world datasets. The goal is not to eliminate them blindly, but to handle them strategically based on context.

There is no universal solution. Always ask: **Why is this data missing?**


### Types of Missing Data

#### 1. Missing Completely at Random (MCAR)

No identifiable pattern in the missingness.

**Example:**  
Survey responses skipped accidentally.

**Strategy:**  
- Safe to drop rows if missing data is small (e.g., <5%)  
- Or fill using averages



#### 2. Missing at Random (MAR)

Missing values are related to other observed variables.

**Example:**  
Older users less likely to provide email addresses.

**Strategy:**  
- Fill using group averages  
- Use related columns to inform imputation



#### 3. Missing Not at Random (MNAR)

Missingness itself carries meaning.

**Example:**  
High earners refuse to report salary.

**Strategy:**  
- Requires domain knowledge  
- May require modeling the missingness



#### Method 1: Dropping Missing Values with `.dropna()`

Removes rows or columns containing missing values.

```python
# Drop rows with ANY missing values
df_clean = df.dropna()

# Drop rows where ALL values are missing
df_clean = df.dropna(how='all')

# Drop rows missing specific columns
df_clean = df.dropna(subset=['Email', 'Phone'])

# Drop columns with missing values
df_clean = df.dropna(axis=1)

# Keep rows with at least 3 non-null values
df_clean = df.dropna(thresh=3)

In [677]:
df_titanic.isna().sum()

Unnamed: 0       0
PassengerId      0
Survived         0
Pclass           0
Unnamed: 4       0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          689
Embarked         2
dtype: int64

In [678]:
# example
df_titanic_clean = df_titanic.dropna()
df_titanic_clean.info()

<class 'pandas.DataFrame'>
Index: 183 entries, 1 to 889
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   183 non-null    int64
 1   PassengerId  183 non-null    int64
 2   Survived     183 non-null    int64
 3   Pclass       183 non-null    str
 4   Unnamed: 4   183 non-null    str
 5   Sex          183 non-null    str
 6   Age          183 non-null    float64
 7   SibSp        183 non-null    int64
 8   Parch        183 non-null    int64
 9   Ticket       183 non-null    str
 10  Fare         183 non-null    float64
 11  Cabin        183 non-null    str
 12  Embarked     183 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 20.0 KB

In [679]:
df_titanic_no_cabin = df_titanic.drop("Cabin",axis=1)
df_titanic.info()

<class 'pandas.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   893 non-null    int64
 1   PassengerId  893 non-null    int64
 2   Survived     893 non-null    int64
 3   Pclass       893 non-null    str
 4   Unnamed: 4   893 non-null    str
 5   Sex          893 non-null    str
 6   Age          716 non-null    float64
 7   SibSp        893 non-null    int64
 8   Parch        893 non-null    int64
 9   Ticket       893 non-null    str
 10  Fare         893 non-null    float64
 11  Cabin        204 non-null    str
 12  Embarked     891 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 90.8 KB

In [680]:
df_titanic_no_cabin_clean = df_titanic_no_cabin.dropna()
df_titanic_no_cabin_clean.info()

<class 'pandas.DataFrame'>
Index: 714 entries, 0 to 892
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   714 non-null    int64
 1   PassengerId  714 non-null    int64
 2   Survived     714 non-null    int64
 3   Pclass       714 non-null    str
 4   Unnamed: 4   714 non-null    str
 5   Sex          714 non-null    str
 6   Age          714 non-null    float64
 7   SibSp        714 non-null    int64
 8   Parch        714 non-null    int64
 9   Ticket       714 non-null    str
 10  Fare         714 non-null    float64
 11  Embarked     714 non-null    str
dtypes: float64(2), int64(5), str(5)
memory usage: 72.5 KB

#### Method 2: Filling Missing Values with .fillna()

Replaces missing values while preserving rows.

```python
# Fill with a specific value
df['Status'] = df['Status'].fillna('Unknown')

# Fill with mean
df['Age'] = df['Age'].fillna(df['Age'].mean())

# Fill with median
df['Salary'] = df['Salary'].fillna(df['Salary'].median())

# Fill with mode
df['City'] = df['City'].fillna(df['City'].mode()[0])

# Forward fill
df['Price'] = df['Price'].fillna(method='ffill')

# Backward fill
df['Price'] = df['Price'].fillna(method='bfill')

# Different strategies per column
df = df.fillna({
    'Age': 0,
    'City': 'Unknown',
    'Score': df['Score'].mean()
})
```

In [681]:
# examples
df_titanic.info()

<class 'pandas.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   893 non-null    int64
 1   PassengerId  893 non-null    int64
 2   Survived     893 non-null    int64
 3   Pclass       893 non-null    str
 4   Unnamed: 4   893 non-null    str
 5   Sex          893 non-null    str
 6   Age          716 non-null    float64
 7   SibSp        893 non-null    int64
 8   Parch        893 non-null    int64
 9   Ticket       893 non-null    str
 10  Fare         893 non-null    float64
 11  Cabin        204 non-null    str
 12  Embarked     891 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 90.8 KB

In [682]:
df_titanic["Age"] = df_titanic["Age"].fillna(df_titanic["Age"].median())

In [683]:
mid = df_titanic["Age"].median()
mid

np.float64(28.0)

In [684]:
df_titanic["Age"] = df_titanic["Age"].fillna(df_titanic["Age"].median)

In [685]:

df_titanic

,Unnamed: 0,PassengerId,Survived,Pclass,Unnamed: 4,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
888,888,889,0,?,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S
889,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
891,890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
892,884,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S

In [686]:
df_titanic.info()

<class 'pandas.DataFrame'>
RangeIndex: 893 entries, 0 to 892
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   893 non-null    int64
 1   PassengerId  893 non-null    int64
 2   Survived     893 non-null    int64
 3   Pclass       893 non-null    str
 4   Unnamed: 4   893 non-null    str
 5   Sex          893 non-null    str
 6   Age          893 non-null    float64
 7   SibSp        893 non-null    int64
 8   Parch        893 non-null    int64
 9   Ticket       893 non-null    str
 10  Fare         893 non-null    float64
 11  Cabin        204 non-null    str
 12  Embarked     891 non-null    str
dtypes: float64(2), int64(5), str(6)
memory usage: 90.8 KB

#### Choosing the Right Fill Strategy
**Numeric Data**

    Mean: Normally distributed data without outliers

    Median: Skewed data or presence of outliers

    0 or -1: When missing indicates absence

**Categorical Data**

    Mode: Most frequent category

    "Unknown": When missing has meaning

    Forward/Backward fill: Time-series data only

| Situation              | Recommended Action | Reason         |
| ---------------------- | ------------------ | -------------- |
| <5% missing            | Drop rows          | Minimal impact |
| 5–15% missing          | Fill strategically | Preserve data  |
| >30% missing column    | Drop column        | Too unreliable |
| Critical field missing | Drop rows          | Cannot proceed |
| Optional field missing | Fill placeholder   | Keep record    |
| Time series data       | Forward/back fill  | Maintain order |

In [687]:
# example
mode = df_titanic["Embarked"].mode()

type(mode)

pandas.Series

In [688]:
print(mode)

0    S
Name: Embarked, dtype: str

### Column Renaming and Standardization

Clean and consistent column names improve readability, reduce errors, and make code easier to maintain. Poor column names create confusion and require extra handling in code.


#### Why Column Names Matter

Messy column names often include:
- Spaces
- Special characters
- Inconsistent casing
- Unclear wording

Example of problematic names:
- "First Name!"
- "Total Sales ($)"
- "E-mail Address"
- "Unnamed: 7"
- "Customer's Age (Years)"

These cause:
- Syntax issues
- Hard-to-read code
- Inconsistent references

Clean versions:
- `first_name`
- `total_sales`
- `email`
- `purchase_count`
- `customer_age`

Benefits:
- Easy to type
- No special characters
- Consistent structure
- Cleaner code (`df.first_name` instead of `df['First Name']`)


### Golden Rules of Column Naming

1. Use lowercase  
2. Replace spaces with underscores  
3. Remove special characters  
4. Keep names descriptive but concise  
5. Use consistent naming patterns (e.g., snake_case)


### Renaming Columns with `.rename()`

#### Rename Specific Columns

```python
df = df.rename(columns={
    'First Name': 'first_name',
    'E-mail': 'email',
    'Total Sales ($)': 'total_sales'
})

In [689]:
df_titanic.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Unnamed: 4', 'Sex',
       'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [690]:
# example
df_titanic = df_titanic.rename(columns={
    "Unnamed: 0":"OriginalIndex",
    "Unnamed: 4": "Name",
    "Pclass":"PClass"
})

In [691]:
df_titanic.columns

Index(['OriginalIndex', 'PassengerId', 'Survived', 'PClass', 'Name', 'Sex',
       'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

## Column Selection Overview

Selecting columns lets you focus on only the data you need, improving code readability, speed, and clarity.

Useful in large datasets (20–100+ columns) where only a subset is needed for analysis

### Single Column Selection

| Method | Syntax         | Notes |
|--------|----------------|-------|
| Dot notation | `df.column` | Cleaner, works if column has no spaces/special chars and doesn't start with a number |
| Bracket notation | `df['column']` | Flexible, works with spaces, special chars, or variable column names |

**Return type:**
- `df['age']` → **Series**  
- `df[['age']]` → **DataFrame**

In [692]:
df_titanic.head()

,OriginalIndex,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [693]:
# example
# method 1
df_titanic.Age

0      220.0
1       38.0
2       26.0
3       35.0
4       35.0
       ...
888     28.0
889     26.0
890     32.0
891     32.0
892     27.0
Name: Age, Length: 893, dtype: float64

In [694]:
df_titanic["Age"]

0      220.0
1       38.0
2       26.0
3       35.0
4       35.0
       ...
888     28.0
889     26.0
890     32.0
891     32.0
892     27.0
Name: Age, Length: 893, dtype: float64

In [695]:
df_titanic[["Age"]]

       Age
0    220.0
1     38.0
2     26.0
3     35.0
4     35.0
..     ...
888   28.0
889   26.0
890   32.0
891   32.0
892   27.0

[893 rows x 1 columns]


### Multiple Column Selection

```python
df[['col1', 'col2']]
important_cols = ['customer_id', 'total_sales']
df[important_cols]
```
    Always use double brackets.

    Can reorder columns or store lists in variables.

    Returns a DataFrame

In [696]:
# example
new_df = df_titanic[["Age","Sex","Survived"]]
new_df

       Age     Sex  Survived
0    220.0    male         0
1     38.0  female         1
2     26.0  female         1
3     35.0  female         1
4     35.0    male         0
..     ...     ...       ...
888   28.0  female         0
889   26.0    male         1
890   32.0    male         0
891   32.0    male         0
892   27.0    male         0

[893 rows x 3 columns]

### Advanced Column Selection
| Technique       | Example                                                     | Use Case                                |
| --------------- | ----------------------------------------------------------- | --------------------------------------- |
| Exclude columns | `df.drop(columns=['email', 'phone'])`                       | Remove unnecessary columns              |
| By data type    | `df.select_dtypes(include=['int64','float64'])`             | Select numeric columns for calculations |
| Pattern-based   | `df.filter(like='sales')` <br> `df.filter(regex='^total_')` | Select columns by substring or regex    |

In [697]:
# example
df_titanic = df_titanic.drop(columns=["OriginalIndex"])
df_titanic.head()

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [698]:
df_titanic.select_dtypes(include=["str"])

,PClass,Name,Sex,Ticket,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,3,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,3,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...,...
888,?,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,1,"Behr, Mr. Karl Howell",male,111369,C148,C
890,3,"Dooley, Mr. Patrick",male,370376,NaN,Q
891,3,"Dooley, Mr. Patrick",male,370376,NaN,Q
892,2,"Montvila, Rev. Juozas",male,211536,NaN,S

In [699]:
df_titanic.filter(like="P")

     PassengerId PClass  Parch
0              1      3      0
1              2      1      0
2              3      3      0
3              4      1      0
4              5      3      0
..           ...    ...    ...
888          889      ?      2
889          890      1      0
890          891      3      0
891          891      3      0
892          887      2      0

[893 rows x 3 columns]

### Pandas Boolean Indexing & Filtering

#### Basics of Boolean Indexing
- Boolean: **True/False** value for each row based on a condition.
- Basic filtering pattern:
```python
df[df['age'] > 30]          # Rows where age > 30
condition = df['age'] > 30
df[condition]               # Same as above

In [700]:
# example
df_titanic_old = df_titanic[df_titanic["Age"]>30]
df_titanic_old["Age"].min()

np.float64(30.5)

In [701]:
#
df_titanic_men = df_titanic[df_titanic["Sex"]=="male"]
df_titanic_men

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
891,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
892,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S

In [702]:
df_titanic_men["Fare"].mean()

np.float64(25.47156563039724)

### Combining Conditions

### AND

In [703]:
# example
# df_titanic_old_men = df_titanic_clean[[df_titanic_clean["Age"] > 30 and df_titanic_clean["Sex"] == "Male"]]

## OR

In [704]:
# example

## NOT

In [705]:
# example

### Text Filtering

.str.contains(), .str.startswith(), .str.endswith()

Case-insensitive: case=False

In [706]:
# example
df_titanic[df_titanic["Name"].str.contains("Mrs")]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [707]:
df_titanic[df_titanic["Name"].str.startswith("A")]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.00,1,5,347082,31.2750,NaN,S
25,26,1,?,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.00,1,5,347077,31.3875,NaN,S
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.00,1,0,7546,9.4750,NaN,S
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.00,1,0,349237,17.8000,NaN,S
68,69,1,3,"Andersson, Miss. Erna Alexandra",female,17.00,4,2,3101281,7.9250,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.00,0,0,347466,7.8542,NaN,S
114,115,0,3,"Attalah, Miss. Malake",female,17.00,0,0,2627,14.4583,NaN,C
119,120,0,?,"Andersson, Miss. Ellis Anna Maria",female,2.00,4,2,347082,31.2750,NaN,S
144,145,0,2,"Andrew, Mr. Edgardo Samuel",male,18.00,0,0,231945,11.5000,NaN,S
146,147,1,?,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.00,0,0,350043,7.7958,NaN,S
182,183,0,3,"Asplund, Master. Clarence Gustaf Hugo",male,9.00,4,2,347077,31.3875,NaN,S
192,193,1,3,"Andersen-Jensen, Miss. Carla Christine Nielsine",female,19.00,1,0,350046,7.8542,NaN,S
207,208,1,3,"Albimona, Mr. Nassef Cassem",male,26.00,0,0,2699,18.7875,NaN,C
210,211,0,3,"Ali, Mr. Ahmed",male,24.00,0,0,SOTON/O.Q. 3101311,7.0500,NaN,S
233,234,1,3,"Asplund, Miss. Lillian Gertrud",female,5.00,4,2,347077,31.3875,NaN,S
244,245,0,3,"Attalah, Mr. Sleiman",male,30.00,0,0,2694,7.2250,NaN,C
261,262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.00,4,2,347077,31.3875,NaN,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.00,1,0,13502,77.9583,D7,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.00,1,1,C.A. 2673,20.2500,NaN,S
297,298,0,1,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.00,1,0,P/PP 3381,24.0000,NaN,C
353,354,0,3,"Arnold-Franchi, Mr. Josef",male,25.00,1,0,349237,17.8000,NaN,S
363,364,0,3,"Asim, Mr. Adola",male,35.00,0,0,SOTON/O.Q. 3101310,7.0500,NaN,S
365,366,0,?,"Adahl, Mr. Mauritz Nils Martin",male,30.00,0,0,C 7076,7.2500,NaN,S
369,370,1,1,"Aubart, Mme. Leontine Pauline",female,24.00,0,0,PC 17477,69.3000,B35,C
401,402,0,3,"Adams, Mr. John",male,26.00,0,0,341826,8.0500,NaN,S
460,461,1,1,"Anderson, Mr. Harry",male,48.00,0,0,19952,26.5500,E12,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.00,0,0,PC 17609,49.5042,NaN,C
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S
518,519,1,2,"Angle, Mrs. William A (Florence ""Mary"" Agnes H...",female,36.00,1,0,226875,26.0000,NaN,S
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.00,4,2,347082,31.2750,NaN,S
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.00,4,2,347082,31.2750,NaN,S
571,572,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.00,2,0,11769,51.4792,C101,S
610,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,39.00,1,5,347082,31.2750,NaN,S
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.00,1,0,PC 17757,227.5250,C62 C64,C
730,731,1,?,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.00,1,1,C.A. 2673,20.2500,NaN,S
780,781,1,3,"Ayoub, Miss. Banoura",female,13.00,0,0,2687,7.2292,NaN,C
784,785,0,3,"Ali, Mr. William",male,25.00,0,0,SOTON/O.Q. 3101312,7.0500,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.00,0,0,112050,0.0000,A36,S
810,811,0,3,"Alexander, Mr. William",male,26.00,0,0,3474,7.8875,NaN,S
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.00,4,2,347082,31.2750,NaN,S
833,834,0,3,"Augustsson, Mr. Albert",male,23.00,0,0,347468,7.8542,NaN,S
834,835,0,3,"Allum, Mr. Owen George",male,18.00,0,0,2223,8.3000,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.00,0,0,SOTON/O2 3101287,7.9250,NaN,S
845,846,0,3,"Abbing, Mr. Anthony",male,42.00,0,0,C.A. 5547,7.5500,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.00,4,2,347082,31.2750,NaN,S
855,856,1,?,"Aks, Mrs. Sam (Leah Rosen)",female,18.00,0,1,392091,9.3500,NaN,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.00,1,0,P/PP 3381,24.0000,NaN,C

### Filtering Against a List

Use .isin() to check multiple values:

In [708]:
# example
df_titanic[df_titanic["Age"].isin([20,30,40])]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
79,80,1,3,"Dowdell, Miss. Elizabeth",female,30.0,0,0,364516,12.4750,NaN,S
91,92,0,3,"Andreasson, Mr. Paul Edvin",male,20.0,0,0,347466,7.8542,NaN,S
113,114,0,3,"Jussila, Miss. Katriina",female,20.0,1,0,4136,9.8250,NaN,S
131,132,0,3,"Coelho, Mr. Domingos Fernandeo",male,20.0,0,0,SOTON/O.Q. 3101307,7.0500,NaN,S
157,158,0,3,"Corn, Mr. Harry",male,30.0,0,0,SOTON/OQ 392090,8.0500,NaN,S
161,162,1,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.0,0,0,C.A. 33595,15.7500,NaN,S
178,179,0,2,"Hale, Mr. Reginald",male,30.0,0,0,250653,13.0000,NaN,S
188,189,0,3,"Bourke, Mr. John",male,40.0,1,1,364849,15.5000,NaN,Q
209,210,1,1,"Blank, Mr. Henry",male,40.0,0,0,112277,31.0000,A31,C
213,214,0,2,"Givard, Mr. Hans Kristensen",male,30.0,0,0,250646,13.0000,NaN,S
219,220,0,2,"Harris, Mr. Walter",male,30.0,0,0,W/C 14208,10.5000,NaN,S
244,245,0,3,"Attalah, Mr. Sleiman",male,30.0,0,0,2694,7.2250,NaN,C
253,254,0,3,"Lobb, Mr. William Arthur",male,30.0,1,0,A/5. 3336,16.1000,NaN,S
257,258,1,1,"Cherry, Miss. Gladys",female,30.0,0,0,110152,86.5000,B77,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0000,B94,S
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
319,320,1,1,"Spedden, Mrs. Frederic Oakley (Margaretta Corn...",female,40.0,1,1,16966,134.5000,E34,C
322,323,1,2,"Slayter, Miss. Hilda Mary",female,30.0,0,0,234818,12.3500,NaN,Q
346,347,1,2,"Smith, Miss. Marion Elsie",female,40.0,0,0,31418,13.0000,NaN,S
360,361,0,3,"Skoog, Mr. Wilhelm",male,40.0,1,4,347088,27.9000,NaN,S
365,366,0,?,"Adahl, Mr. Mauritz Nils Martin",male,30.0,0,0,C 7076,7.2500,NaN,S
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S
418,419,0,2,"Matthews, Mr. William John",male,30.0,0,0,28228,13.0000,NaN,S
441,442,0,3,"Hampe, Mr. Leon",male,20.0,0,0,345769,9.5000,NaN,S
452,453,0,1,"Foreman, Mr. Benjamin Laventall",male,30.0,0,0,113051,27.7500,C111,C
488,489,0,3,"Somerton, Mr. Francis William",male,30.0,0,0,A.5. 18509,8.0500,NaN,S
520,521,1,1,"Perreault, Miss. Anne",female,30.0,0,0,12749,93.5000,B73,S
534,535,0,3,"Cacic, Miss. Marija",female,30.0,0,0,315084,8.6625,NaN,S
537,538,1,1,"LeRoy, Miss. Bertha",female,30.0,0,0,PC 17761,106.4250,NaN,C
561,562,0,3,"Sivic, Mr. Husein",male,40.0,0,0,349251,7.8958,NaN,S
606,607,0,3,"Karaic, Mr. Milan",male,30.0,0,0,349246,7.8958,NaN,S
609,610,1,1,"Shutes, Miss. Elizabeth W",female,40.0,0,0,PC 17582,153.4625,C125,S
622,623,1,3,"Nakid, Mr. Sahid",male,20.0,1,1,2653,15.7417,NaN,C
640,641,0,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
661,662,0,3,"Badt, Mr. Mohamed",male,40.0,0,0,2623,7.2250,NaN,C
664,665,1,3,"Lindqvist, Mr. Eino William",male,20.0,1,0,STON/O 2. 3101285,7.9250,NaN,S
670,671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",female,40.0,1,1,29750,39.0000,NaN,S
682,683,0,3,"Olsvigen, Mr. Thor Anderson",male,20.0,0,0,6563,9.2250,NaN,S
725,726,0,3,"Oreskovic, Mr. Luka",male,20.0,0,0,315094,8.6625,NaN,S
726,727,1,?,"Renouf, Mrs. Peter Henry (Lillian Jefferys)",female,30.0,3,0,31027,21.0000,NaN,S
747,748,1,2,"Sinkkonen, Miss. Anna",female,30.0,0,0,250648,13.0000,NaN,S
762,763,1,3,"Barah, Mr. Hanna Assi",male,20.0,0,0,2663,7.2292,NaN,C
798,799,0,3,"Ibrahim Shawah, Mr. Yousseff",male,30.0,0,0,2685,7.2292,NaN,C
799,800,0,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S
840,841,0,3,"Alhomaki, Mr. Ilmari Rudolf",male,20.0,0,0,SOTON/O2 3101287,7.9250,NaN,S
842,843,1,1,"Serepeca, Miss. Augusta",female,30.0,0,0,113798,31.0000,NaN,C
876,877,0,3,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,0,7534,9.8458,NaN,S

### Range Filtering

.between() for cleaner range checks:

In [709]:
# example
df_titanic[df_titanic["Age"].between(18,31)]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
17,18,1,2,"Williams, Mr. Charles Eugene",male,28.0,0,0,244373,13.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,?,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
892,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S

## Pandas `.query()` Method Cheat Sheet

### What is `.query()`?
- Cleaner, SQL-like way to filter rows.
- Write conditions as **strings** instead of messy brackets.
- Uses **and/or/not** instead of `&/|/~`.
- Parentheses usually not required.

In [710]:
# example

## Basic Syntax

```python
df.query("condition_as_string")
# Examples:
older_customers = df.query("age > 30")
ny_customers = df.query("city == 'New York'")
filtered = df.query("age > 30 and city == 'Boston'")
coasts = df.query("city == 'NYC' or city == 'LA'")
```

In [711]:
# example

df_titanic.query("Age > 30 and Survived == 1 or SibSp == 1")

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
888,889,0,?,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S

### Combining Conditions

```python
df.query("state == 'CA' and total_sales > 500")
```

In [712]:
# example and

In [713]:
# example or

In [714]:
# example not

### Using Python Variables

Reference Python variables with @
```python
        min_age = 25
        max_age = 40
        target_city = 'Boston'

        result = df.query("age >= @min_age and age <= @max_age")
        city_filter = df.query("city == @target_city")

```

In [715]:
# example
age = 30
sib_sp =1

df_titanic.query("Age > @age and Survived == 1 or SibSp == @sib_sp")

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
888,889,0,?,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S

### Operators Examples

| Operator | Meaning          | Example                             |
| -------- | ---------------- | ----------------------------------- |
| `>`      | Greater than     | `df.query("age > 30")`              |
| `<`      | Less than        | `df.query("price < 100")`           |
| `>=`     | Greater or equal | `df.query("score >= 75")`           |
| `<=`     | Less or equal    | `df.query("inventory <= 10")`       |
| `==`     | Equal            | `df.query("city == 'Boston'")`      |
| `!=`     | Not equal        | `df.query("status != 'cancelled'")` |

### Pandas `.iloc[]` (Position-Based Selection)

#### What is `.iloc[]`?
- Select rows and columns **by integer position**.
- Row 0 = first row, row 1 = second row… Python uses **0-based indexing**.
- Useful for: sampling, previewing, systematic extraction, train/test splits.


#### Selecting Rows

##### Single Row
```python
first_row = df.iloc[0]       # Row 0
second_row = df.iloc[1]      # Row 1
last_row = df.iloc[-1]       # Last row

In [716]:
# example
df_titanic.iloc[-1]

PassengerId                      887
Survived                           0
PClass                             2
Name           Montvila, Rev. Juozas
Sex                             male
Age                             27.0
SibSp                              0
Parch                              0
Ticket                        211536
Fare                            13.0
Cabin                            NaN
Embarked                           S
Name: 892, dtype: object

### Multiple Rows (Slicing)
```python
df.iloc[start:stop:step]
```

In [717]:
# example start stop
df_titanic.iloc[5:11]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,28.0,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [ ]:
# example start stop step
df_titanic.iloc[0:5:2,3::2]

,PassengerId,Survived,PClass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,220.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

### Selecting Rows AND Columns
```python
    df.iloc[rows, columns]
```

In [ ]:
# example

### .iloc[] vs .loc[]
| Method    | Selection Type    | Notes                                                |
| --------- | ----------------- | ---------------------------------------------------- |
| `.iloc[]` | integer positions | stop is EXCLUDED, index-based, good for samples      |
| `.loc[]`  | labels / Boolean  | stop is INCLUDED, can filter by labels or conditions |